trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d1debd3c-ebad-4fd6-b5cc-a168c5541d0c">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="0f146454-5751-41ac-9858-ed8e82493ca9">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ff486bfa-32f9-483b-a31f-217330dd926b">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ab8e653a-6710-4566-aa65-0d5ea7f238c5">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce328e11-efc3-4665-b4b8-c81faf099f64">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cd3fb855-d4a5-4870-b2f5-784d225e96f4">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.БлокировкаДвиженияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

&После("ЗаполнитьПараметрыИнициализации")
Процедура Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ПериодОстатки",  Новый МоментВремени(ДокументСсылка.Дата,ДокументСсылка));
	
КонецПроцедуры

&Вместо("ТекстЗапросаТаблицаДвиженияСерийТоваров")
Функция Док_ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ДвиженияСерийТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Количество КАК Количество,
	|	&Склад КАК Получатель,
	|	&Помещение КАК ПомещениеПолучателя,
	|	&Отправитель КАК Отправитель,
	|	&СкладскаяОперация КАК СкладскаяОперация,
	|	&Ссылка КАК Документ,
	|	&Период КАК Период,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение
	|ИЗ
	|	ВтТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);  
	
	// + Альтерра
	ИмяРегистра = "БлокировкаДвиженияТоваров";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	&Склад КАК Склад,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.ПричинаБлокировки КАК ПричинаБлокировки,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Количество > ВложенныйЗапрос.КоличествоПланКонечныйОстаток
		|			ТОГДА ВложенныйЗапрос.КоличествоПланКонечныйОстаток
		|		ИНАЧЕ ТаблицаТовары.Количество
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Количество > ВложенныйЗапрос.КоличествоПланКонечныйОстаток
		|			ТОГДА -ВложенныйЗапрос.КоличествоПланКонечныйОстаток
		|		ИНАЧЕ -ТаблицаТовары.Количество
		|	КОНЕЦ КАК КоличествоПлан
		|ИЗ
		|	ВтТаблицаТовары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.Характеристика КАК Характеристика,
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.ПричинаБлокировки КАК ПричинаБлокировки,
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.КоличествоПланНачальныйОстаток КАК КоличествоПланНачальныйОстаток,
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.КоличествоПланКонечныйОстаток КАК КоличествоПланКонечныйОстаток
		|		ИЗ
		|			РегистрНакопления.БлокировкаДвиженияТоваров.ОстаткиИОбороты(, &ПериодОстатки, Регистратор, , ) КАК БлокировкаДвиженияТоваровОстаткиИОбороты
		|		ГДЕ
		|			БлокировкаДвиженияТоваровОстаткиИОбороты.Регистратор.ДокументОснование = &Распоряжение) КАК ВложенныйЗапрос
		|		ПО (ВложенныйЗапрос.Номенклатура = ТаблицаТовары.Номенклатура)
		|			И (ВложенныйЗапрос.Характеристика = ТаблицаТовары.Характеристика)
		|ГДЕ
		|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
		|   И ВложенныйЗапрос.КоличествоПланКонечныйОстаток > 0
		|	И (ТаблицаТовары.Ссылка.Распоряжение ССЫЛКА Документ.ВозвратТоваровОтКлиента
		|			ИЛИ ТаблицаТовары.Ссылка.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
		|			ИЛИ ТаблицаТовары.Ссылка.Распоряжение ССЫЛКА Документ.КорректировкаРеализации)";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	// -

	
	Возврат ТекстЗапроса;
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("БлокировкаДвиженияТоваров");   
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
	
КонецПроцедуры                            

&ИзменениеИКонтроль ("ДанныеДокументаДляПроведения")
Функция Док_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	Иначе
		ДокументОбъект = Неопределено;
		ДокументСсылка = Неопределено;
	КонецЕсли;

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры); 
		#Вставка 
		ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументСсылка);
		#КонецВставки
		
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ПринятьТоварНаСклад(Запрос, ТекстыЗапроса, Регистры);
	ЗарегистрироватьИзлишкиНедостачиНаСкладе(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции


&После("ОтразитьРаспределениеЗапасовДвижения")
Процедура Док_ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаБлокировок", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаБлокировок(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапросаТабЧасть =
	"ВЫБРАТЬ
	|	ТабЧасть.Ссылка 		КАК Ссылка,
	|	&Период 				КАК Период,
	|	ТабЧасть.Номенклатура 	КАК Номенклатура,
	|	ТабЧасть.Характеристика КАК Характеристика,
	|	&Склад 					КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)  	КАК Назначение,
	|	ВЫБОР
	|		КОГДА ТабЧасть.Количество > ВтТаблицаБлокировок.КоличествоПланКонечныйОстаток
	|			ТОГДА ВтТаблицаБлокировок.КоличествоПланКонечныйОстаток
	|		ИНАЧЕ ТабЧасть.Количество
	|	КОНЕЦ 					КАК Количество,
	|	НЕОПРЕДЕЛЕНО 			КАК ЗапланированныйРасходРаспределенногоЗапаса,
	|	ИСТИНА 					КАК КонтрольСвободногоОстатка,
	|	ЛОЖЬ 					КАК ИгнорироватьРезервыПриКонтролеОстатков
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ТабЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаБлокировок КАК ВтТаблицаБлокировок
	|		ПО (ВтТаблицаБлокировок.Номенклатура = ТабЧасть.Номенклатура)
	|			И (ВтТаблицаБлокировок.Характеристика = ТабЧасть.Характеристика)
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И ВтТаблицаБлокировок.КоличествоПланКонечныйОстаток > 0
	|	И (ТабЧасть.Ссылка.Распоряжение ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ИЛИ ТабЧасть.Ссылка.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
	|			ИЛИ ТабЧасть.Ссылка.Распоряжение ССЫЛКА Документ.КорректировкаРеализации)";
	
	РаспределениеЗапасовДвижения.РасходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть); 
			
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаБлокировок(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаБлокировок"; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.Характеристика КАК Характеристика,
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.ПричинаБлокировки КАК ПричинаБлокировки,
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.КоличествоПланНачальныйОстаток КАК КоличествоПланНачальныйОстаток,
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.КоличествоПланКонечныйОстаток КАК КоличествоПланКонечныйОстаток
	|ПОМЕСТИТЬ ВтТаблицаБлокировок
	|ИЗ
	|	РегистрНакопления.БлокировкаДвиженияТоваров.ОстаткиИОбороты(, &ПериодОстатки, Регистратор, , ) КАК БлокировкаДвиженияТоваровОстаткиИОбороты
	|ГДЕ
	|	БлокировкаДвиженияТоваровОстаткиИОбороты.Регистратор.ДокументОснование = &Распоряжение";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Распоряжение.Организация КАК Организация,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|	И Штрихкоды.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#Область ОбщиеМетодыДляФормПриходныхОрдеровТСД

Процедура ПолучитьЯчейку(Номенклатура, Склад, Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Ячейка = РезультатЗапроса.Ячейка;
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменитьЯчейку(Номенклатура, Склад, Ячейка, НоваяЯчейка) Экспорт
	
	Записано = Ложь;
	
	Попытка
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Отбор.Склад.Установить(Склад);
		НаборЗаписей.Отбор.Ячейка.Установить(Ячейка);
		НаборЗаписей.Записать();
		
		МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Ячейка = НоваяЯчейка;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.ОсновнаяЯчейка=Истина;
		
		МенеджерЗаписи.Записать();
		
		Записано = Истина;
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение      
		Сообщить("Ошибка записи!");
		Записано = Ложь;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Записано;	
	
КонецФункции

Процедура ПолучитьАдресКартинки(Номенклатура, УникальныйИдентификатор, АдресКартинки) Экспорт

	Попытка
		ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
		Если ЗначениеЗаполнено(ФайлКартинки) тогда
			АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
			Возврат;
		КонецЕсли;  
	Исключение    
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти изображение номенклатуры..");
	КонецПопытки;
	
	АдресКартинки = "";
	
КонецПроцедуры

Функция ПолучитьНеопознанныйТовар(Склад, Номер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НеопНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК НеопНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
		|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
		|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Свободно,
		|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
		|		ИЗ
		|			РегистрНакопления.ЗапасыИПотребности.Остатки(
		|					,
		|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЗапасыИПотребностиОстатки.Номенклатура) КАК СвободныеОстаткиОстатки
		|		ПО (СвободныеОстаткиОстатки.Номенклатура = НеопНоменклатура.Ссылка)
		|ГДЕ
		|	НеопНоменклатура.НеопознанныйТовар = ИСТИНА
		|	И НеопНоменклатура.ПометкаУдаления = ЛОЖЬ
		|	И ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) = 0";

	Запрос.УстановитьПараметр("Склад", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат СоздатьНовуюНеопознаннуюНоменклатуру(Номер);
	
КонецФункции

Функция СоздатьНовуюНеопознаннуюНоменклатуру(Номер)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НачатьТранзакцию();
		
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();	
		СсылкаНового = Справочники.Номенклатура.ПолучитьСсылку();
		НоваяНоменклатура.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовойНоменклатуры = НоваяНоменклатура.ПолучитьСсылкуНового();
		
		НоваяНоменклатура.Наименование = "Неопознанная номенклатура (" + Строка(Номер) + " " + Строка(ТекущаяДата()) + ")"; 
		НоваяНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("Неопознанно");
		НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Новый товар");
		НоваяНоменклатура.НеопознанныйТовар = ИСТИНА;
		НоваяНоменклатура.Качество = Перечисления.ГрадацииКачества.Новый;
		
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НоваяНоменклатура);
		
		НоваяНоменклатура.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат СсылкаНовойНоменклатуры;
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Неопределено;  
	
КонецФункции

Функция ПроверитьНеобходимостьЗапускаБП(Ссылка) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
    "ВЫБРАТЬ
    |	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура
    |ИЗ
    |	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
    |ГДЕ
    |	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка
    |	И ПриходныйОрдерНаТоварыТовары.Номенклатура.НеопознанныйТовар";
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	// Проверяем был ли уже запущен БП по этому ордеру.
	НаборЗаписей = РегистрыСведений.СобытияОбъектовАльтерра.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Событие.Установить(Справочники.СобытияОбъектовАльтерра.ЗапущенБППоНеопознаннойНоменклатуре);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток) Экспорт
	
    УстановитьПривилегированныйРежим(Истина);
	
	ИДТипаБлока = "lists_socnet";
	ИДБлока = "208";
	КодЭлемента =  СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()), "-", ""); 
		
	РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Дата, Номер, Менеджер"); 
	РуководительСекции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийУчасток, "Руководитель");
	
	СтруктураПараметров = Новый Структура;  
	СтруктураПараметров.Вставить("NAME", "Неопознанная номенклатура");
	СтруктураПараметров.Вставить("PROPERTY_3937", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(РеквизитыЗаказа.Менеджер));
	СтруктураПараметров.Вставить("PROPERTY_3938", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(РуководительСекции));
	СтруктураПараметров.Вставить("PROPERTY_3939", Строка(Формат(РеквизитыЗаказа.Дата, "ДФ=dd.MM.yyyy")));
    СтруктураПараметров.Вставить("PROPERTY_3940", РеквизитыЗаказа.Номер);
			
	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка(ИДТипаБлока, ИДБлока, КодЭлемента, СтруктураПараметров, Истина);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("Результат") Или СтруктураОтвета.Свойство("result") Тогда
		Запись = РегистрыСведений.СобытияОбъектовАльтерра.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Объект = Ссылка; 
		Запись.Событие = Справочники.СобытияОбъектовАльтерра.ЗапущенБППоНеопознаннойНоменклатуре; 
		Запись.Записать(); 
		Сообщить("БП запущен");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

 Процедура ЗапуститьБпПоОтсутствиюКодаМаркировки(Ссылка,Распоряжение,РабочийУчасток, БлокировкаКМ) Экспорт
	
    УстановитьПривилегированныйРежим(Истина);

	ИДТипаБлока = "lists_socnet";
	ИДБлока = "261";
	КодЭлемента =  СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()), "-", "");   
	
	РеквизитыБлокировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БлокировкаКМ, "Дата,Номер");
	РуководительСекции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийУчасток, "Руководитель");
	РеквизитыРаспоряжения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Менеджер,Представление");
		
	СтруктураПараметров = Новый Структура;  
	СтруктураПараметров.Вставить("NAME", "Отсутствие кода маркировки"); 
	
	СтруктураПараметров.Вставить("PROPERTY_4930", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(РеквизитыРаспоряжения.Менеджер));
	СтруктураПараметров.Вставить("PROPERTY_4931", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(РуководительСекции));
      
	СтруктураПараметров.Вставить("PROPERTY_4946", РеквизитыРаспоряжения.Представление);
    
    СтруктураПараметров.Вставить("PROPERTY_4939", Строка(Формат(РеквизитыБлокировки.Дата, "ДФ=dd.MM.yyyy")));
    СтруктураПараметров.Вставить("PROPERTY_4940", РеквизитыБлокировки.Номер);
	СтруктураПараметров.Вставить("PROPERTY_4941", ПолучитьНавигационнуюСсылку(БлокировкаКМ));

	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка(ИДТипаБлока, ИДБлока, КодЭлемента, СтруктураПараметров, Истина);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("Результат") Или СтруктураОтвета.Свойство("result") Тогда
		Запись = РегистрыСведений.СобытияОбъектовАльтерра.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Объект = Ссылка; 
		Запись.Событие = Справочники.СобытияОбъектовАльтерра.ЗапущенБППоОтсутствиюКодаМаркировки; 
		Запись.Записать(); 
		Сообщить("БП запущен");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	
КонецПроцедуры 

Функция ПолучитьБлокировкуРасхождениеКМ(Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование
		|   И БлокировкаДвиженияТоваров.ПричинаБлокировки = &ПричинаРасхождениеКМ
		|	И БлокировкаДвиженияТоваров.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ПричинаРасхождениеКМ",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (нет кода маркировки)"));

	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
 КонецФункции
#КонецЕсли
